React_Module_Scripts/React_Absence_Reason/Absence_React_api_Test.yml
execution:
#- executor: jmeter
- concurrency: 100
  ramp-up: 100s
  hold-for: 50m
  scenario: Absence Reason_Get_Put_Api

scenarios:
  Absence Reason_Get_Put_Api:
    script: Absence Reason_Get_Put_Api.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed